infra/kaggle/kernel_openfoam_xfid_v16_jammy_round4/case_template/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
// Raised from 500 (docs/problem_resolution_plan_2026_09.md C7): at the finest qualification
// grid (V3, ~1.3M cells) 500 iterations was not enough headroom even after fixing the
// relaxation-induced stall below -- see _fv_solution's comment and
// work/stage_v_grid_convergence_fix/relax_probe_more_damping/log.simpleFoam. With the corrected
// relaxation the fine-grid p residual decays monotonically (no longer stalled or diverging) but
// its tail decelerates: over iterations 500-620 of that probe it fell by less than half, from
// order 1.9e-4 to 8.5e-5 against the 1e-5 gate. Extrapolating that decelerating rate, several
// thousand iterations are plausibly needed, not several hundred; 3000 is a reasoned buffer, not
// a proven sufficient value -- see the Stage V grid-convergence report for the measured outcome.
// This is a project setting, not physics; V0-V2 already converge in 90-300 iterations and are
// unaffected by the higher cap.
endTime         3000;
deltaT          1;
writeControl    timeStep;
writeInterval   100;
purgeWrite      2;
writeFormat     ascii;
writePrecision  8;
runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        patches         (design_candidate);
        rho             rhoInf;
        rhoInf          1;
        magUInf         1;
        lRef            0.8;
        Aref            0.64;
        CofR            (0.25 0 0);
        dragDir         (1 0 0);
        liftDir         (0 0 1);
        pitchAxis       (0 1 0);
        writeControl    timeStep;
        writeInterval   1;
    }
}
