infra/kaggle/kernel_openfoam_xfid_v16_jammy_round4/case_template/system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

design_candidate.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    {
        includedAngle   150;
    }
    writeObj            yes;
}
